In [1]:
import psycopg2
import pandas as pd
host = "host.docker.internal"
dbname = "postgres"
user = "postgres"
password = "Newpassword"
port = "5432"

conn = psycopg2.connect(
    host=host,
    dbname=dbname,
    user=user,
    password=password,
    port=port
)

cur = conn.cursor()

Aankomst

In [2]:
query = '''
SELECT *
FROM raw_1.aankomst;
'''

df = pd.read_sql(query, conn)


print(df.info())
print(df.describe())
print(df.isnull().sum())
print(df.duplicated().sum())

/tmp/ipykernel_84625/1781718487.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 386061 entries, 0 to 386060
Data columns (total 8 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   Vluchtid       386061 non-null  object
 1   Vliegtuigcode  386061 non-null  object
 2   Terminal       385961 non-null  object
 3   Gate           326100 non-null  object
 4   Baan           386059 non-null  object
 5   Bezetting      329475 non-null  object
 6   Vracht         49967 non-null   object
 7   Aankomsttijd   382688 non-null  object
dtypes: object(8)
memory usage: 23.6+ MB
None
       Vluchtid Vliegtuigcode Terminal    Gate    Baan Bezetting Vracht  \
count    386061        386061   385961  326100  386059    329475  49967
unique   386061           424        7      30       6        56     49
top      935998        VFR735        C      C1       4        86     38
freq          1          2922   107109   20475  208209     18949   1716

               Aankomsttijd
count                382688
unique               341707
top     2017-02-05 11:37:00
freq                      6
Vluchtid              0
Vliegtuigcode         0
Terminal            100
Gate              59961
Baan                  2
Bezetting         56586
Vracht           336094
Aankomsttijd       3373
dtype: int64
0

In [3]:
query = '''
SELECT *
FROM raw_1.aankomst;
'''

df_original = pd.read_sql(query, conn)

df_dropped = df_original[(df_original['Vracht'].isnull()) & (df_original['Bezetting'].isnull())]

df_cleaned = df_original.drop(df_dropped.index)

print("Dropped rows:")
print(df_dropped.head())

print("Cleaned DataFrame:")
print(df_cleaned.head())

/tmp/ipykernel_84625/1383076265.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_original = pd.read_sql(query, conn)

Dropped rows:
   Vluchtid Vliegtuigcode Terminal  Gate Baan Bezetting Vracht  \
26   936045          VG50        G  None    6      None   None
51   936098         VG171        G  None    6      None   None
57   936110         VG162        G  None    6      None   None
67   936127          VG97        G  None    6      None   None
77   936150          VG79        G  None    6      None   None

           Aankomsttijd
26  2014-01-01 06:55:00
51  2014-01-01 08:51:00
57  2014-01-01 09:30:00
67  2014-01-01 10:04:00
77  2014-01-01 10:56:00
Cleaned DataFrame:
  Vluchtid Vliegtuigcode Terminal Gate Baan Bezetting Vracht  \
0   935998        VFR735        A   A1    1        45   None
1   936001        VHV303        A   A2    1        62   None
2   936009        VKL301        C   C1    1        58   None
3   936012        VTK505        B   B5    1        67   None
4   936013        VKL859        C   C2    1        71   None

          Aankomsttijd
0  2014-01-01 03:53:00
1  2014-01-01 04:15:00
2  2014-01-01 04:38:00
3  2014-01-01 04:43:00
4  2014-01-01 04:54:00

Klant

In [4]:
query = '''
SELECT *
FROM raw_1.klant;
'''

df = pd.read_sql(query, conn)
df_info = pd.read_sql('SELECT * FROM raw_1.klant', conn)
df_ids = pd.read_sql('SELECT "Vluchtid" FROM raw_1.vlucht', conn)
result_df = pd.merge(df_ids, df_info, on='Vluchtid', how='left')
print(result_df.info())
print(result_df.describe())
print(result_df.isnull().sum())
print(result_df.duplicated().sum())
print(result_df.head())

/tmp/ipykernel_84625/1069304493.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)
/tmp/ipykernel_84625/1069304493.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_info = pd.read_sql('SELECT * FROM raw_1.klant', conn)
/tmp/ipykernel_84625/1069304493.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_ids = pd.read_sql('SELECT "Vluchtid" FROM raw_1.vlucht', conn)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 772512 entries, 0 to 772511
Data columns (total 4 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   Vluchtid      772512 non-null  object
 1   Operatie      2110 non-null    object
 2   Faciliteiten  2110 non-null    object
 3   Shops         1845 non-null    object
dtypes: object(4)
memory usage: 23.6+ MB
None
       Vluchtid Operatie Faciliteiten Shops
count    772512     2110         2110  1845
unique   772512       47           69    48
top      935992      7.3          7.6     6
freq          1      143           67   100
Vluchtid             0
Operatie        770402
Faciliteiten    770402
Shops           770667
dtype: int64
0
  Vluchtid Operatie Faciliteiten Shops
0   935992      NaN          NaN   NaN
1   935993      NaN          NaN   NaN
2   935994      NaN          NaN   NaN
3   935995      NaN          NaN   NaN
4   935996      NaN          NaN   NaN

Luchthaven

In [5]:
query = '''
SELECT *
FROM raw_1.luchthavens;
'''

df = pd.read_sql(query, conn)


print(df.info())
print(df.describe())
print(df.isnull().sum())
print(df.duplicated().sum())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8107 entries, 0 to 8106
Data columns (total 11 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Airport  8107 non-null   object
 1   City     8107 non-null   object
 2   Country  8107 non-null   object
 3   IATA     5880 non-null   object
 4   ICAO     8043 non-null   object
 5   Lat      8107 non-null   object
 6   Lon      8107 non-null   object
 7   Alt      8107 non-null   object
 8   TZ       8107 non-null   object
 9   DST      8107 non-null   object
 10  Tz       8107 non-null   object
dtypes: object(11)
memory usage: 696.8+ KB
None
          Airport    City        Country  IATA  ICAO        Lat   Lon   Alt  \
count        8107    8107           8107  5880  8043       8107  8107  8107
unique       7908    6977            240  5878  6782       7985  7987  2416
top     North Sea  London  United States   ZYA    \N  30.524819     1     0
freq           16      21           1697     2  1258          4     4   584

          TZ   DST                Tz
count   8107  8107              8107
unique    38     7               294
top        1     U  America/New_York
freq    1390  2195               628
Airport       0
City          0
Country       0
IATA       2227
ICAO         64
Lat           0
Lon           0
Alt           0
TZ            0
DST           0
Tz            0
dtype: int64
29

/tmp/ipykernel_84625/2102288786.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

In [6]:
query = '''
SELECT *
FROM raw_1.luchthavens;
'''

df_original = pd.read_sql(query, conn)

df_dropped = df_original[(df_original['IATA'].isnull())]
df_dropped = df_dropped.drop_duplicates(subset=['IATA'])


df_cleaned = df_original.drop(df_dropped.index)

print("Dropped rows:")
print(df_dropped.head())

print("Cleaned DataFrame:")
print(df_cleaned.head())

Dropped rows:
         Airport          City      Country  IATA  ICAO        Lat        Lon  \
1  Camp Bastion   Camp Bastion  Afghanistan  None  OAZI  31.865556  64.195278

    Alt   TZ DST          Tz
1  2808  4.5   N  Asia/Kabul
Cleaned DataFrame:
               Airport         City      Country IATA  ICAO        Lat  \
0       Bamyan Airport       Bamyan  Afghanistan  BIN  OABN  34.816667
2  Chaghcharan Airport  Chaghcharan  Afghanistan  CCN  OACC  34.526667
3     Faizabad Airport     Faizabad  Afghanistan  FBD  OAFZ    37.1211
4                Herat        Herat  Afghanistan  HEA  OAHR  34.210017
5            Jalalabad    Jalalabad  Afghanistan  JAA  OAJL  34.399842

         Lon   Alt   TZ DST          Tz
0  67.816667  2550  4.5   N  Asia/Kabul
2  65.271667  7383  4.5   U  Asia/Kabul
3    70.5181  3872  4.5   U  Asia/Kabul
4    62.2283  3206  4.5   U  Asia/Kabul
5  70.498625  1814  4.5   U  Asia/Kabul

/tmp/ipykernel_84625/1918566129.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_original = pd.read_sql(query, conn)

maatschapijen

In [7]:
query = '''
SELECT *
FROM raw_1.maatschappijen;
'''

df = pd.read_sql(query, conn)


print(df.info())
print(df.describe())
print(df.isnull().sum())
print(df.duplicated().sum())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1166 entries, 0 to 1165
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    1166 non-null   object
 1   IATA    964 non-null    object
 2   ICAO    1137 non-null   object
dtypes: object(3)
memory usage: 27.5+ KB
None
          Name IATA  ICAO
count     1166  964  1137
unique    1160  933  1006
top     Comair   G3    \N
freq         2    3   118
Name      0
IATA    202
ICAO     29
dtype: int64
0

/tmp/ipykernel_84625/849084060.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

In [8]:
query = '''
SELECT *
FROM raw_1.maatschappijen;
'''

df_original = pd.read_sql(query, conn)

df_dropped = df_original[(df_original['IATA'].isnull())]

df_cleaned = df_original.drop(df_dropped.index)

print("Dropped rows:")
print(df_dropped.head())

print("Cleaned DataFrame:")
print(df_cleaned.head())

Dropped rows:
                        Name  IATA ICAO
583        Al-Naser Airlines  None   \N
965  ConneX European Airline  None  2CO
966     Aerolineas Africanas  None  AA1
967               Copterline  None  AAQ
968            ACES Colombia  None  AES
Cleaned DataFrame:
                     Name IATA  ICAO
0          Private flight    -  None
1                 Unknown    -  None
2             ELK Airways   --   ELK
3  Tom\\'s & co airliners   &T   T&O
4          Wilderness Air   ;;    \N

/tmp/ipykernel_84625/3978819632.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_original = pd.read_sql(query, conn)

planning

In [9]:
query = '''
SELECT *
FROM raw_1.planning;
'''

df = pd.read_sql(query, conn)


print(df.info())
print(df.describe())
print(df.isnull().sum())
print(df.duplicated().sum())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 693 entries, 0 to 692
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Vluchtnr      693 non-null    object
 1   Airlinecode   693 non-null    object
 2   Destcode      693 non-null    object
 3   Planterminal  574 non-null    object
 4   Plangate      574 non-null    object
 5   Plantijd      574 non-null    object
dtypes: object(6)
memory usage: 32.6+ KB
None
       Vluchtnr Airlinecode Destcode Planterminal Plangate  Plantijd
count       693         693      693          574      574       574
unique      693          79      109            5       29       226
top      9W2888          KL      LHR            C       A1  12:00 PM
freq          1         126       22          178       32         8
Vluchtnr          0
Airlinecode       0
Destcode          0
Planterminal    119
Plangate        119
Plantijd        119
dtype: int64
0

/tmp/ipykernel_84625/997722463.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

In [10]:
query = '''
SELECT *
FROM raw_1.planning;
'''

df_original = pd.read_sql(query, conn)

df_dropped = df_original[(df_original['Planterminal'].isnull()) & (df_original['Plangate'].isnull()) & (df_original['Plantijd'].isnull())]

df_cleaned = df_original.drop(df_dropped.index)

print("Dropped rows:")
print(df_dropped.head())

print("Cleaned DataFrame:")
print(df_cleaned.head())

Dropped rows:
   Vluchtnr Airlinecode Destcode Planterminal Plangate Plantijd
80  CAL6085         CAL      BKK         None     None     None
81  CAL6163         CAL      BKK         None     None     None
82  CAL7069         CAL      BKK         None     None     None
83  CAL8463         CAL      TPE         None     None     None
84  CAL8831         CAL      TPE         None     None     None
Cleaned DataFrame:
  Vluchtnr Airlinecode Destcode Planterminal Plangate Plantijd
0   9W2888          9W      DEL            D       D2  2:10 PM
1   9W2889          9W      DEL            D       D2  3:25 PM
2    A3598          A3      ATH            A       A6  5:10 AM
3    A3599          A3      ATH            A       A6  5:55 AM
4    A3600          A3      ATH            A       A6  2:45 PM

/tmp/ipykernel_84625/2693201063.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_original = pd.read_sql(query, conn)

vertrek

In [11]:
query = '''
SELECT *
FROM raw_1.vertrek;
'''

df = pd.read_sql(query, conn)


print(df.info())
print(df.describe())
print(df.isnull().sum())
print(df.duplicated().sum())

/tmp/ipykernel_84625/1887319564.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 386447 entries, 0 to 386446
Data columns (total 8 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   Vluchtid       386447 non-null  object
 1   Vliegtuigcode  386447 non-null  object
 2   Terminal       386347 non-null  object
 3   Gate           326101 non-null  object
 4   Baan           386445 non-null  object
 5   Bezetting      329474 non-null  object
 6   Vracht         49967 non-null   object
 7   Vertrektijd    383076 non-null  object
dtypes: object(8)
memory usage: 23.6+ MB
None
       Vluchtid Vliegtuigcode Terminal    Gate    Baan Bezetting Vracht  \
count    386447        386447   386347  326101  386445    329474  49967
unique   386447           433        7      30       6        56     49
top      935992        VTK297        C      C1       3        86     35
freq          1          2922   107109   20475  210694     19269   1761

                Vertrektijd
count                383076
unique               339500
top     2017-08-23 15:16:00
freq                      6
Vluchtid              0
Vliegtuigcode         0
Terminal            100
Gate              60346
Baan                  2
Bezetting         56973
Vracht           336480
Vertrektijd        3371
dtype: int64
0

In [12]:
query = '''
SELECT *
FROM raw_1.vertrek;
'''

df_original = pd.read_sql(query, conn)

df_dropped = df_original[(df_original['Vracht'].isnull()) & (df_original['Bezetting'].isnull())]

df_cleaned = df_original.drop(df_dropped.index)

print("Dropped rows:")
print(df_dropped.head())

print("Cleaned DataFrame:")
print(df_cleaned.head())

/tmp/ipykernel_84625/161730964.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_original = pd.read_sql(query, conn)

Dropped rows:
    Vluchtid Vliegtuigcode Terminal  Gate Baan Bezetting Vracht  \
58    936106          VG43        G  None    6      None   None
59    936107          VG92        G  None    6      None   None
72    936139          VG28        G  None    6      None   None
105   936201          VG14        G  None    6      None   None
111   936211          VG74        G  None    6      None   None

             Vertrektijd
58   2014-01-01 09:13:00
59   2014-01-01 09:15:00
72   2014-01-01 10:37:00
105  2014-01-01 12:58:00
111  2014-01-01 13:15:00
Cleaned DataFrame:
  Vluchtid Vliegtuigcode Terminal Gate Baan Bezetting Vracht  \
0   935992        VTK297        B   B5    2        69   None
1   935993       VDL5829        D   D5    2        78   None
2   935994       VSU1831        D   D3    2        85   None
3   935995       VEZY741        C   C4    2        54   None
4   935996        VKL499        C   C2    2        71   None

           Vertrektijd
0  2014-01-01 02:46:00
1  2014-01-01 02:57:00
2  2014-01-01 03:07:00
3  2014-01-01 03:33:00
4  2014-01-01 03:48:00

vliegtuig

In [13]:
query = '''
SELECT *
FROM raw_1.vliegtuig;
'''

df = pd.read_sql(query, conn)

print(df.info())
print(df.describe())
print(df.isnull().sum())
print(df.duplicated().sum())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 557 entries, 0 to 556
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Airlinecode    557 non-null    object
 1   Vliegtuigcode  557 non-null    object
 2   Vliegtuigtype  557 non-null    object
 3   Bouwjaar       557 non-null    object
dtypes: object(4)
memory usage: 17.5+ KB
None
       Airlinecode Vliegtuigcode Vliegtuigtype Bouwjaar
count          557           557           557      557
unique          80           557            47       44
top              -        VTK297           74Y     1983
freq           255             1            54       21
Airlinecode      0
Vliegtuigcode    0
Vliegtuigtype    0
Bouwjaar         0
dtype: int64
0

/tmp/ipykernel_84625/3583273317.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

vliegtuigtype

In [14]:
query = '''
SELECT *
FROM raw_1.vliegtuigtype;
'''

df = pd.read_sql(query, conn)

print(df.info())
print(df.describe())
print(df.isnull().sum())
print(df.duplicated().sum())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 327 entries, 0 to 326
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   IATA        327 non-null    object
 1   ICAO        264 non-null    object
 2   Merk        319 non-null    object
 3   Type        327 non-null    object
 4   Wake        312 non-null    object
 5   Cat         285 non-null    object
 6   Capaciteit  117 non-null    object
 7   Vracht      115 non-null    object
dtypes: object(8)
memory usage: 20.6+ KB
None
       IATA  ICAO    Merk                             Type Wake  Cat  \
count   327   264     319                              327  312  285
unique  327   186      47                              326    4    6
top     100  DC10  Boeing  BAe 146 Freighter (-200QT & QC)    M  Pax
freq      1     7      66                                2  168  163

       Capaciteit Vracht
count         117    115
unique         55     21
top             0      8
freq           15     36
IATA            0
ICAO           63
Merk            8
Type            0
Wake           15
Cat            42
Capaciteit    210
Vracht        212
dtype: int64
0

/tmp/ipykernel_84625/3780369025.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

vlucht

In [15]:
query = '''
SELECT *
FROM raw_1.vlucht;
'''

df = pd.read_sql(query, conn)

print(df.info())
print(df.describe())
print(df.isnull().sum())
print(df.duplicated().sum())

/tmp/ipykernel_84625/250393908.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 772512 entries, 0 to 772511
Data columns (total 6 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   Vluchtid       772512 non-null  object
 1   Vluchtnr       758887 non-null  object
 2   Airlinecode    772512 non-null  object
 3   Destcode       772512 non-null  object
 4   Vliegtuigcode  772512 non-null  object
 5   Datum          772512 non-null  object
dtypes: object(6)
memory usage: 35.4+ MB
None
       Vluchtid Vluchtnr Airlinecode Destcode Vliegtuigcode       Datum
count    772512   758887      772512   772512        772512      772512
unique   772512      693          80      115           557        1462
top      935992    TK297          KL      LHR        VTK297  2017-08-16
freq          1     1461      150969    28820          5844         656
Vluchtid             0
Vluchtnr         13625
Airlinecode          0
Destcode             0
Vliegtuigcode        0
Datum                0
dtype: int64
0

weer

In [16]:
query = '''
SELECT *
FROM raw_1.weer;
'''

df = pd.read_sql(query, conn)

print(df.info())
print(df.describe())
print(df.isnull().sum())
print(df.duplicated().sum())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1461 entries, 0 to 1460
Data columns (total 40 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Datum   1461 non-null   object
 1   DDVEC   1461 non-null   object
 2   FHVEC   1461 non-null   object
 3   FG      1461 non-null   object
 4   FHX     1461 non-null   object
 5   FHXH    1461 non-null   object
 6   FHN     1461 non-null   object
 7   FHNH    1461 non-null   object
 8   FXX     1461 non-null   object
 9   FXXH    1461 non-null   object
 10  TG      1461 non-null   object
 11  TN      1461 non-null   object
 12  TNH     1461 non-null   object
 13  TX      1461 non-null   object
 14  TXH     1461 non-null   object
 15  T10N    1461 non-null   object
 16  T10NH   1461 non-null   object
 17  SQ      1461 non-null   object
 18  SP      1461 non-null   object
 19  Q       1461 non-null   object
 20  DR      1461 non-null   object
 21  RH      1461 non-null   object
 22  RHX     1461 non-null   object
 23  RHXH    1461 non-null   object
 24  PG      1461 non-null   object
 25  PX      1461 non-null   object
 26  PXH     1461 non-null   object
 27  PN      1461 non-null   object
 28  PNH     1461 non-null   object
 29  VVN     1461 non-null   object
 30  VVNH    1461 non-null   object
 31  VVX     1461 non-null   object
 32  VVXH    1461 non-null   object
 33  NG      1461 non-null   object
 34  UG      1461 non-null   object
 35  UX      1461 non-null   object
 36  UXH     1461 non-null   object
 37  UN      1461 non-null   object
 38  UNH     1461 non-null   object
 39  EV2     1461 non-null   object
dtypes: object(40)
memory usage: 456.7+ KB
None
             Datum DDVEC FHVEC    FG   FHX  FHXH   FHN  FHNH   FXX  FXXH  ...  \
count         1461  1461  1461  1461  1461  1461  1461  1461  1461  1461  ...
unique        1461   344    83    82    14    24    10    24    23    24  ...
top     2014-01-01   224    26    25    50    12    10     1   100    12  ...
freq             1    17    46    66   347   154   628   450   178   164  ...

        VVNH   VVX  VVXH    NG    UG    UX   UXH    UN   UNH   EV2
count   1461  1461  1461  1461  1461  1461  1461  1461  1461  1461
unique    24    44    24     9    57    39    24    77    24    55
top        1    75    13     8    83    98     1    56    14     2
freq     188   234   166   332    70   286   295    40   282   138

[4 rows x 40 columns]
Datum    0
DDVEC    0
FHVEC    0
FG       0
FHX      0
FHXH     0
FHN      0
FHNH     0
FXX      0
FXXH     0
TG       0
TN       0
TNH      0
TX       0
TXH      0
T10N     0
T10NH    0
SQ       0
SP       0
Q        0
DR       0
RH       0
RHX      0
RHXH     0
PG       0
PX       0
PXH      0
PN       0
PNH      0
VVN      0
VVNH     0
VVX      0
VVXH     0
NG       0
UG       0
UX       0
UXH      0
UN       0
UNH      0
EV2      0
dtype: int64
0

/tmp/ipykernel_84625/335375757.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

In [71]:
query = '''
SELECT 
t1."Vluchtid",
t1."Vluchtnr",
t1."Vliegtuigcode",
l."Vliegtuigtype",
l."Bouwjaar",
t1."Terminal",
t1."Gate",
t1."Baan",
t1."Bezetting",
t1."Vracht",
t1."Type",
p."Plantijd",
t1."Tijd",
t1."Airlinecode",
t1."Destcode",
t1."Datum"
FROM
(SELECT
"Vluchtid",
MAX("Vluchtnr") AS "Vluchtnr",
MAX("Vliegtuigcode") AS "Vliegtuigcode",
MAX("Terminal") AS "Terminal",
MAX("Gate") AS "Gate",
MAX("Baan") AS "Baan",
MAX("Bezetting") AS "Bezetting",
MAX("Vracht") AS "Vracht",
MAX("Type") AS "Type",
MAX("Tijd") AS "Tijd",
MAX("Airlinecode") AS "Airlinecode",
MAX("Destcode") AS "Destcode",
MAX("Datum") AS "Datum"
FROM
(SELECT
"Vluchtid",
NULL AS "Vluchtnr",
NULL AS "Vliegtuigcode",
"Terminal",
"Gate",
"Baan",
"Bezetting",
"Vracht",
"Type",
"Tijd",
NULL AS "Airlinecode",
NULL AS "Destcode",
NULL AS "Datum"
FROM
(SELECT "Vluchtid","Vliegtuigcode","Terminal","Gate","Baan","Bezetting","Vracht", 'aankomst' AS "Type", "Aankomsttijd" As "Tijd"
FROM cleansed.aankomst 
UNION
SELECT "Vluchtid","Vliegtuigcode","Terminal","Gate","Baan","Bezetting","Vracht", 'vertrek' AS "Type", "Vertrektijd" As "Tijd"
FROM cleansed.vertrek) AS combined
UNION
SELECT
"Vluchtid",
"Vluchtnr",
"Vliegtuigcode",
NULL AS "Terminal",
NULL AS "Gate",
NULL AS "Baan",
NULL AS "Bezetting",
NULL AS "Vracht",
NULL AS "Type",
NULL AS "Tijd",
"Airlinecode",
"Destcode",
"Datum"
FROM
cleansed.vlucht v) AS doublescheme
GROUP BY "Vluchtid") t1
LEFT JOIN
cleansed.vliegtuig l
ON
t1."Vliegtuigcode" = l."Vliegtuigcode"
LEFT JOIN
cleansed.planning p
ON
t1."Vluchtnr" = p."Vluchtnr";
'''
df = pd.read_sql(query, conn)

print(df.head())
print("---------------------------------") # 758883  772512 
print(df.info())
print(df.describe())
print(df.isnull().sum())
print(df.duplicated().sum())

/tmp/ipykernel_84625/2470613425.py:82: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

   Vluchtid Vluchtnr Vliegtuigcode Vliegtuigtype  Bouwjaar Terminal Gate  \
0    935992    TK297        VTK297           321    1970.0        B   B5
1    935993   DL5829       VDL5829           320    2007.0        D   D5
2    935994   SU1831       VSU1831           321    2012.0        D   D3
3    935995   EZY741       VEZY741           738    1978.0        C   C4
4    935996    KL500        VKL499           738    1982.0        C   C2

   Baan  Bezetting  Vracht     Type  Plantijd                Tijd Airlinecode  \
0   2.0       69.0     NaN  vertrek  02:25:00 2014-01-01 02:46:00          TK
1   2.0       78.0     NaN  vertrek  02:15:00 2014-01-01 02:57:00          DL
2   2.0       85.0     NaN  vertrek  02:25:00 2014-01-01 03:07:00          SU
3   2.0       54.0     NaN  vertrek  03:05:00 2014-01-01 03:33:00         EZY
4   2.0       71.0     NaN  vertrek  03:40:00 2014-01-01 03:48:00          KL

  Destcode       Datum
0      ESB  2014-01-01
1      DTW  2014-01-01
2      SVO  2014-01-01
3      ACE  2014-01-01
4      VIE  2014-01-01
---------------------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 772513 entries, 0 to 772512
Data columns (total 16 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   Vluchtid       772513 non-null  int64
 1   Vluchtnr       758887 non-null  object
 2   Vliegtuigcode  772512 non-null  object
 3   Vliegtuigtype  772512 non-null  object
 4   Bouwjaar       772512 non-null  float64
 5   Terminal       758683 non-null  object
 6   Gate           652201 non-null  object
 7   Baan           758879 non-null  float64
 8   Bezetting      658949 non-null  float64
 9   Vracht         99934 non-null   float64
 10  Type           758883 non-null  object
 11  Plantijd       658945 non-null  object
 12  Tijd           752139 non-null  datetime64[ns]
 13  Airlinecode    772512 non-null  object
 14  Destcode       772512 non-null  object
 15  Datum          772512 non-null  object
dtypes: datetime64[ns](1), float64(4), int64(1), object(10)
memory usage: 94.3+ MB
None
           Vluchtid       Bouwjaar           Baan      Bezetting  \
count  7.725130e+05  772512.000000  758879.000000  658949.000000
mean   1.322375e+06    1990.358216       3.169022      82.555865
min    9.359920e+05    1970.000000       1.000000      45.000000
25%    1.129120e+06    1980.000000       2.000000      77.000000
50%    1.322248e+06    1989.000000       3.000000      84.000000
75%    1.515376e+06    2001.000000       4.000000      89.000000
max    1.000000e+08    2013.000000       5.000000     100.000000
std    2.496717e+05      13.008838       1.198586       9.222820

             Vracht                           Tijd
count  99934.000000                         752139
mean      44.116417  2016-01-27 11:21:36.473896704
min       21.000000            2014-01-01 02:46:00
25%       35.000000            2015-02-06 11:27:30
50%       44.000000            2016-02-12 16:44:00
75%       53.000000            2017-01-26 20:58:00
max       69.000000            2018-01-01 00:19:00
std       10.556779                            NaN
Vluchtid              0
Vluchtnr          13626
Vliegtuigcode         1
Vliegtuigtype         1
Bouwjaar              1
Terminal          13830
Gate             120312
Baan              13634
Bezetting        113564
Vracht           672579
Type              13630
Plantijd         113568
Tijd              20374
Airlinecode           1
Destcode              1
Datum                 1
dtype: int64
0

In [18]:
fact_table = df
airlines_dim = pd.read_sql('SELECT * from cleansed.maatschappijen',conn)
mapping_table = airlines_dim[['IATA', 'ICAO', 'Name']]
fact_table = pd.merge(fact_table, mapping_table, left_on='Airlinecode', right_on='IATA', how='left')
fact_table = pd.merge(fact_table, mapping_table, left_on='Airlinecode', right_on='ICAO', how='left', suffixes=('_IATA', '_ICAO'))
fact_table['Name'] = fact_table['Name_IATA'].fillna(fact_table['Name_ICAO'])
fact_table.drop(['Name_IATA', 'Name_ICAO','IATA_IATA','ICAO_IATA','IATA_ICAO','ICAO_ICAO'], axis=1, inplace=True)
fact_table.rename(columns={'Name': 'Airline_name'}, inplace=True)

print("fact--------------------------")
print(fact_table.head())

/tmp/ipykernel_84625/3998791869.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  airlines_dim = pd.read_sql('SELECT * from cleansed.maatschappijen',conn)

fact--------------------------
   Vluchtid Vluchtnr Vliegtuigcode Vliegtuigtype  Bouwjaar Terminal Gate  \
0    936018    A3598        VA3599           320    2000.0        A   A6
1    936024    HV573        VHV573           763    1971.0        A   A2
2    936027    A3599        VA3599           320    2000.0        A   A6
3    936028    FR454        VFR455           332    2000.0        A   A1
4    936032   KL5715       VKL5715           772    1988.0        E   E1

   Baan  Bezetting  Vracht      type  Plantijd                tijd  \
0   1.0       61.0     NaN  aankomst  05:10:00 2014-01-01 05:35:00
1   1.0       63.0     NaN  aankomst  05:40:00 2014-01-01 06:01:00
2   2.0       59.0     NaN   vertrek  05:55:00 2014-01-01 06:15:00
3   1.0       57.0     NaN  aankomst  06:05:00 2014-01-01 06:16:00
4   1.0       72.0     NaN  aankomst  05:50:00 2014-01-01 06:28:00

  Airlinecode Destcode       Datum              Airline_name
0          A3      ATH  2014-01-01           Aegean Airlines
1          HV      LIS  2014-01-01         Transavia Holland
2          A3      ATH  2014-01-01           Aegean Airlines
3          FR      LIS  2014-01-01                   Ryanair
4          KL      DAR  2014-01-01  KLM Royal Dutch Airlines